https://www.kaggle.com/datasets/wenruliu/adult-income-dataset

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('adult.csv')
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

# EDA

In [3]:
df.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  object
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  object
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  object
 6   occupation       48842 non-null  object
 7   relationship     48842 non-null  object
 8   race             48842 non-null  object
 9   gender           48842 non-null  object
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  object
 14  income           48842 non-null  object
dtypes: int64(6), object(9)
memory usage: 5.6+ MB

In [5]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educational-num',
       'marital-status', 'occupation', 'relationship', 'race', 'gender',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

In [6]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [7]:
categorical_features = [i for i in df.columns if df[i].dtype == 'O']
numerical_features = [i for i in df.columns if df[i].dtype != 'O']

In [8]:
categorical_features

['workclass',
 'education',
 'marital-status',
 'occupation',
 'relationship',
 'race',
 'gender',
 'native-country',
 'income']

In [9]:
numerical_features

['age',
 'fnlwgt',
 'educational-num',
 'capital-gain',
 'capital-loss',
 'hours-per-week']

In [10]:
for i in categorical_features:
    print(i," feature has ",len(df[i].unique())," unique features")

workclass  feature has  9  unique features
education  feature has  16  unique features
marital-status  feature has  7  unique features
occupation  feature has  15  unique features
relationship  feature has  6  unique features
race  feature has  5  unique features
gender  feature has  2  unique features
native-country  feature has  42  unique features
income  feature has  2  unique features

In [11]:
for i in categorical_features:
    print(i," feature has : ",df[i].value_counts())
    print("\n\n")

workclass  feature has :  Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: int64



education  feature has :  HS-grad         15784
Some-college    10878
Bachelors        8025
Masters          2657
Assoc-voc        2061
11th             1812
Assoc-acdm       1601
10th             1389
7th-8th           955
Prof-school       834
9th               756
12th              657
Doctorate         594
5th-6th           509
1st-4th           247
Preschool          83
Name: education, dtype: int64



marital-status  feature has :  Married-civ-spouse       22379
Never-married            16117
Divorced                  6633
Separated                 1530
Widowed                   1518
Married-spouse-absent      628
Married-AF-spouse           37
Name: marital-status, dtype: int64



occupation  feature has :  Prof-specialty       6172
Craft-repair         6112
Exec-managerial      6086
Adm-clerical         5611
Sales                5504
Other-service        4923
Machine-op-inspct    3022
?                    2809
Transport-moving     2355
Handlers-cleaners    2072
Farming-fishing      1490
Tech-support         1446
Protective-serv       983
Priv-house-serv       242
Armed-Forces           15
Name: occupation, dtype: int64



relationship  feature has :  Husband           19716
Not-in-family     12583
Own-child          7581
Unmarried          5125
Wife               2331
Other-relative     1506
Name: relationship, dtype: int64



race  feature has :  White                 41762
Black                  4685
Asian-Pac-Islander     1519
Amer-Indian-Eskimo      470
Other                   406
Name: race, dtype: int64



gender  feature has :  Male      32650
Female    16192
Name: gender, dtype: int64



native-country  feature has :  United-States                 43832
Mexico                          951
?                               857
Philippines                     295
Germany                         206
Puerto-Rico                     184
Canada                          182
El-Salvador                     155
India                           151
Cuba                            138
England                         127
China                           122
South                           115
Jamaica                         106
Italy                           105
Dominican-Republic              103
Japan                            92
Guatemala                        88
Poland                           87
Vietnam                          86
Columbia                         85
Haiti                            75
Portugal                         67
Taiwan                           65
Iran                             59
Greece                           49
Nicaragua                        49
Peru                             46
Ecuador                          45
France                           38
Ireland                          37
Hong                             30
Thailand                         30
Cambodia                         28
Trinadad&Tobago                  27
Laos                             23
Yugoslavia                       23
Outlying-US(Guam-USVI-etc)       23
Scotland                         21
Honduras                         20
Hungary                          19
Holand-Netherlands                1
Name: native-country, dtype: int64



income  feature has :  <=50K    37155
>50K     11687
Name: income, dtype: int64

In [13]:
for i in numerical_features:
    print(i," feature has : ",df[i].value_counts())
    print("\n\n")

age  feature has :  36    1348
35    1337
33    1335
23    1329
31    1325
      ...
88       6
85       5
87       3
89       2
86       1
Name: age, Length: 74, dtype: int64



fnlwgt  feature has :  203488    21
190290    19
120277    19
125892    18
126569    18
          ..
188488     1
285290     1
293579     1
114874     1
257302     1
Name: fnlwgt, Length: 28523, dtype: int64



educational-num  feature has :  9     15784
10    10878
13     8025
14     2657
11     2061
7      1812
12     1601
6      1389
4       955
15      834
5       756
8       657
16      594
3       509
2       247
1        83
Name: educational-num, dtype: int64



capital-gain  feature has :  0        44807
15024      513
7688       410
7298       364
99999      244
         ...
1111         1
7262         1
22040        1
1639         1
2387         1
Name: capital-gain, Length: 123, dtype: int64



capital-loss  feature has :  0       46560
1902      304
1977      253
1887      233
2415       72
        ...
2465        1
2080        1
155         1
1911        1
2201        1
Name: capital-loss, Length: 99, dtype: int64



hours-per-week  feature has :  40    22803
50     4246
45     2717
60     2177
35     1937
      ...
69        1
87        1
94        1
82        1
79        1
Name: hours-per-week, Length: 96, dtype: int64

# Label Enconding

In [14]:
def make_dict(lst):
    dict={}
    count=1
    for i in lst:
        dict[i]=count
        count+=1
    return dict

In [15]:
for i in categorical_features:
    dict = make_dict(df[i].unique())
    print(dict)
    df[i] = df[i].map(dict)
    print('\n\n')

{'Private': 1, 'Local-gov': 2, '?': 3, 'Self-emp-not-inc': 4, 'Federal-gov': 5, 'State-gov': 6, 'Self-emp-inc': 7, 'Without-pay': 8, 'Never-worked': 9}



{'11th': 1, 'HS-grad': 2, 'Assoc-acdm': 3, 'Some-college': 4, '10th': 5, 'Prof-school': 6, '7th-8th': 7, 'Bachelors': 8, 'Masters': 9, 'Doctorate': 10, '5th-6th': 11, 'Assoc-voc': 12, '9th': 13, '12th': 14, '1st-4th': 15, 'Preschool': 16}



{'Never-married': 1, 'Married-civ-spouse': 2, 'Widowed': 3, 'Divorced': 4, 'Separated': 5, 'Married-spouse-absent': 6, 'Married-AF-spouse': 7}



{'Machine-op-inspct': 1, 'Farming-fishing': 2, 'Protective-serv': 3, '?': 4, 'Other-service': 5, 'Prof-specialty': 6, 'Craft-repair': 7, 'Adm-clerical': 8, 'Exec-managerial': 9, 'Tech-support': 10, 'Sales': 11, 'Priv-house-serv': 12, 'Transport-moving': 13, 'Handlers-cleaners': 14, 'Armed-Forces': 15}



{'Own-child': 1, 'Husband': 2, 'Not-in-family': 3, 'Unmarried': 4, 'Wife': 5, 'Other-relative': 6}



{'Black': 1, 'White': 2, 'Asian-Pac-Islander': 3, 'Other': 4, 'Amer-Indian-Eskimo': 5}



{'Male': 1, 'Female': 2}



{'United-States': 1, '?': 2, 'Peru': 3, 'Guatemala': 4, 'Mexico': 5, 'Dominican-Republic': 6, 'Ireland': 7, 'Germany': 8, 'Philippines': 9, 'Thailand': 10, 'Haiti': 11, 'El-Salvador': 12, 'Puerto-Rico': 13, 'Vietnam': 14, 'South': 15, 'Columbia': 16, 'Japan': 17, 'India': 18, 'Cambodia': 19, 'Poland': 20, 'Laos': 21, 'England': 22, 'Cuba': 23, 'Taiwan': 24, 'Italy': 25, 'Canada': 26, 'Portugal': 27, 'China': 28, 'Nicaragua': 29, 'Honduras': 30, 'Iran': 31, 'Scotland': 32, 'Jamaica': 33, 'Ecuador': 34, 'Yugoslavia': 35, 'Hungary': 36, 'Hong': 37, 'Greece': 38, 'Trinadad&Tobago': 39, 'Outlying-US(Guam-USVI-etc)': 40, 'France': 41, 'Holand-Netherlands': 42}



{'<=50K': 1, '>50K': 2}

In [16]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,1,226802,1,7,1,1,1,1,1,0,0,40,1,1
1,38,1,89814,2,9,2,2,2,2,1,0,0,50,1,1
2,28,2,336951,3,12,2,3,2,2,1,0,0,40,1,2
3,44,1,160323,4,10,2,1,2,1,1,7688,0,40,1,2
4,18,3,103497,4,10,1,4,1,2,2,0,0,30,1,1

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48842 entries, 0 to 48841
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              48842 non-null  int64
 1   workclass        48842 non-null  int64
 2   fnlwgt           48842 non-null  int64
 3   education        48842 non-null  int64
 4   educational-num  48842 non-null  int64
 5   marital-status   48842 non-null  int64
 6   occupation       48842 non-null  int64
 7   relationship     48842 non-null  int64
 8   race             48842 non-null  int64
 9   gender           48842 non-null  int64
 10  capital-gain     48842 non-null  int64
 11  capital-loss     48842 non-null  int64
 12  hours-per-week   48842 non-null  int64
 13  native-country   48842 non-null  int64
 14  income           48842 non-null  int64
dtypes: int64(15)
memory usage: 5.6 MB

# Split data

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,1,226802,1,7,1,1,1,1,1,0,0,40,1,1
1,38,1,89814,2,9,2,2,2,2,1,0,0,50,1,1
2,28,2,336951,3,12,2,3,2,2,1,0,0,40,1,2
3,44,1,160323,4,10,2,1,2,1,1,7688,0,40,1,2
4,18,3,103497,4,10,1,4,1,2,2,0,0,30,1,1

In [20]:
x=df.drop(['income'],axis=1)
y=df['income']
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.2, random_state=42)

In [21]:
x_train.shape

(39073, 14)

In [22]:
y_train.shape

(39073,)

# Apply Naive Bayes

In [23]:
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import accuracy_score

In [24]:
nb = GaussianNB()
nb.fit(x_train , y_train)
pred = nb.predict(x_test)
print(accuracy_score(pred,y_test))

0.7996724332070836

**Attributes**

In [25]:
print(nb.class_count_)

[29676.  9397.]

In [26]:
print(nb.class_prior_)

[0.75950145 0.24049855]

In [27]:
print(nb.classes_)

[1 2]

In [28]:
print(nb.epsilon_)

11.109901323386957

In [29]:
print(nb.n_features_in_)

14

In [30]:
print(nb.feature_names_in_)

['age' 'workclass' 'fnlwgt' 'education' 'educational-num' 'marital-status'
 'occupation' 'relationship' 'race' 'gender' 'capital-gain' 'capital-loss'
 'hours-per-week' 'native-country']

In [31]:
print(nb.var_)

[[2.10262758e+02 1.35328580e+01 1.13034961e+10 2.32130034e+01
  1.70644398e+01 1.27878475e+01 2.29754379e+01 1.26691819e+01
  1.13859500e+01 1.13472341e+01 8.62359493e+05 9.87576106e+04
  1.65656123e+02 3.62870392e+01]
 [1.22807428e+02 1.52617167e+01 1.04973039e+10 2.07630559e+01
  1.67441362e+01 1.15896605e+01 1.84731358e+01 1.20399951e+01
  1.12556644e+01 1.12393637e+01 2.15586534e+08 3.58538771e+05
  1.35151573e+02 3.85356821e+01]]

In [32]:
print(nb.theta_)

[[3.68235611e+01 1.83373770e+00 1.89943038e+05 4.78184391e+00
  9.59398167e+00 2.12235476e+00 7.28629195e+00 2.61342499e+00
  1.97405311e+00 1.38745114e+00 1.46909860e+02 5.47704542e+01
  3.88380510e+01 2.27530665e+00]
 [4.43027562e+01 2.31935724e+00 1.88675924e+05 6.06129616e+00
  1.16012557e+01 2.11748430e+00 7.79376397e+00 2.45035650e+00
  2.01159945e+00 1.15281473e+00 3.99926349e+03 1.98124508e+02
  4.54498244e+01 2.23635203e+00]]